import React from 'react'
import { useState } from 'react'
import { NavLink } from 'react-router-dom'
import DemonstrationContent from './DemonstrationContent'
import image from '../../image/imagenote.jpg'
import monkey from '../../image/monkey.jpg'
import Badges from './materialize/badges'

const MainPage = () => {
  const [statusContent, setStatusContent] = useState(false)
   
  return(
   <div className ="main-page">
     { !statusContent ? <MainContent setStatusContent = {setStatusContent}/> 
                       : <DemonstrationContent setStatusContent = {setStatusContent} /> }
   </div>
  )
}

const MainContent = ({setStatusContent}) => {
   return(
    <div className='main-content'>
    <h4 className = "top-title">
      Гуманізація тайм - менеджменту
    </h4>
     <p className="title-main"><img src={image} alt="image"/>
       <p className="title-sentence">Вчинок породжує звичку, звичка - характер, а характер - долю. <br/> 
       <span>Давнє прислів'я.</span></p>
       Одна з причин неефективності численних моделей тайм-менеджменту полягає в механічному підході до формулювання завдань, коли різні по пріоритету, типу та внутрішній складності задачі складаються в один блок, в результаті чого користувач опиняється перед непідйомною брилою незроблених справ, що дедалі більше пригнічує психіку та формує поведінку уникання. Людина розчаровується у своїй здатності втілити задумане у життя, все більше прокрастинує та втрачає мотивацію.    
     </p>
     <h5>Лагідний підхід</h5>
      <p>
      Щоб вийти із зачарованого кола усе більшого числа взятих на себе зобов'язань і все меншого бажання їх виконувати необхідно сконцентруватись на психології. Оскільки ефективною може бути тільки та система, яка в своїх базових механізмах не вступає в конфлікт зі схильностями та патернами поведінки людини. Цей додаток створено на основі концепцій Максима Дорофеєва, який своєю чергою виходив із моделі Тіма Урбана. Дізнатися детальніше можна тут - <a href="https://www.youtube.com/watch?v=1Zr_ydPsmas&t=89s">Завдання, проекти, ідеї. Максим Дорофеєв</a> та <a href="https://www.youtube.com/watch?v=arj7oStGLkU">Модель Тіма Урбана</a>.      
      </p>
      <p className='middle-title'> <img src= {monkey} alt="image"/>
      Дана модель в алегоричній формі описує людську психіку, як боротьбу між "мавпочкою миттєвого задоволення" та "раціональним типом", спочатку мавпочка перемагає, людина перебуває в напівсвідомому стані, розконцентрована, неохоча до глибоких і послідовних роздумів. Потім приходить "панічний монстр", мавпочку відтісняє раціональний тип, людина оговтується і приступає до аналізу свого становища. Знайшовши вихід вона швидко заспокоюється, нею знову заволодіває "мавпочка миттєвого задоволення" і все починається заново.
     </p>
     <p>Таким чином, формуючи список завдань, потрібно враховувати в якому "режимі" психіки їх найкраще виконувати. Є задачі які вирішуються автоматично, майже бездумно, а є такі, що вимагають глибокого дослідження чи пошуку креативних рішень.</p>
     <h5>Структура задач</h5>
     <p className='section-barge'>
      Ми пропонуємо розділити задачі на три типи в залежності від того наскільки ясний алгоритм для їх вирішення та яких ресурсів це від нас вимагає. Такими типами є <span>завдання</span>,<span> проекти</span> та <span>ідеї</span>. Завдяки цьому підходу можна застосувати тонші налаштування для організації списку завдань, що враховуватимуть особливості психології та зроблять роботу із ними значно ефективнішими і комфортнішими. 
    </p>
      <Badges/>
     <div className = 'demonstration'> 
       <div className=' child-text'>
         <h5>Знайомство</h5>
          <p>Для повноцінного користування додатком вам потрібно <NavLink to='/auth'>зареєструватись</NavLink>, але ви можете ознайомитися з його функціональністю і без реєстрації, у тестовому режимі.</p>
       </div>
       <div className='child-demo'>
         <button onClick= {() => setStatusContent(true)}  className='btn'>Тестувати</button>
       </div>
     </div>
   </div>
  )
}



export default MainPage